app/Controllers/Admin/PostController.php

UPDATE `menu` SET `label_menu` = 'एमालेले बुझ्न मानेन महानगरको जरिवाना पत्र', `url_menu` = 'एमालेले-बुझ्न-मानेन-महानगरको-जरिवाना-पत्र'
WHERE `content_id` = '1'
AND `content_type` = '2'
---
                'label_menu' => $this->request->getPost('post_title'),
                'url_menu' => $slug,
            ];
            $this->menuModel->where('content_id', $id)->where('content_type', '2')->update(null, $menuArray);