app/Models/Admin/Newstickermodel.php

    public function getAllticker()
    {

       return $this->join('categorytbl', ' categorytbl.cat_id=  new_ticker.category_id','right')->where('categorytbl.delete_status','0')
            ->findAll();
---
SELECT *
FROM `new_ticker`
RIGHT JOIN `categorytbl` ON `categorytbl`.`cat_id`=  `new_ticker`.`category_id`
WHERE `categorytbl`.`delete_status` = '0'